Repository: MaximMonakhov/crypt_signature
Catalog: ios/Resources/*.lproj/CP_Localizable.strings
Languages: ru

source: Authentication:
ru: Аутентификация:

source: CA type: CPCA 1.5
ru: Тип УЦ: КриптоПро УЦ 1.5

source: CA type: CPCA 2.0
ru: Тип УЦ: КриптоПро УЦ 2.0

source: CA type: MSCA std
ru: Тип УЦ: Microsoft УЦ

source: CA URL:
ru: URL УЦ:

source: Verify server name
ru: Проверять имя сервера

source: Certificate
ru: По сертификату

source: Token
ru: По токену

source: None
ru: Без аутентификации

source: Install CA certificate
ru: Установить корневой сертификат

source: Register new user
ru: Зарегистрировать нового пользователя

source: Check registration status
ru: Проверить состояние регистрации

source: Create and send certificate request
ru: Отправить запрос на сертификат

source: Get and install certificate
ru: Получить и установить сертификат

source: Close marker
ru: Закрыть маркер временного доступа

source: Print
ru: Напечатать

source: View request
ru: Перейти к запросу

source: Install
ru: Установить

source: Register
ru: Зарегистрировать

source: Interact with CA
ru: Взаимодействие с УЦ

source: Delete all keys and certificates
ru: Удалить все ключи и сертификаты

source: Check integrity
ru: Проверить целостность

source: Manage license
ru: Управление лицензией

source: Exit
ru: Выход

source: Certificate requests
ru: Запросы на сертификат

source: sent date
ru: дата отправки

source: approval date
ru: дата обработки

source: comment
ru: комментарий

source: status
ru: состояние

source: Cancel
ru: Отмена

source: Select:
ru: Выберите:

source: Select template:
ru: Выберите шаблон:

source: Request CryptPro CSP license
ru: Запросить лицензию на КриптоПро CSP

source: Delete certificates and keys
ru: Удаление ключей и сертификатов

source: Do you really want to delete all certificates and private keys?
ru: Вы действительно хотите удалить все ключи и сертификаты?

source: Delete certificates and keys completed
ru: Удаление ключей и сертификатов завершено

source: Delete certificates and keys failed
ru: Не удалось удалить ключи и сертификаты

source: Cant't get license information
ru: Не удалось получить информацию о лицензии

source: Permanent license.
ru: Постоянная лицензия.

source: License not set.
ru: Лицензия не установлена.

source: Invalid serial number.
ru: Некорректный серийный номер.

source: License expired or not yet valid.
ru: Срок действия лицензии истёк или ещё не наступил.

source: Expires: %d month(s) %d day(s).
ru: Истекает через %d месяца(цев) %d дня(ей)

source: Expires: %d day(s).
ru: Лицензия истекает через %d дня(ей)

source: License management
ru: Управление лицензией

source: Close
ru: Закрыть

source: Input serial
ru: Ввести лицензию

source: Input license:
ru: Введите лицензию:

source: License was set.
ru: Лицензия была установлена.

source: License was not set.
ru: Лицензия не была установлена

source: Request was send
ru: Запрос отправлен

source: Bad SSL certificate
ru: Ошибка сертификата SSL

source: Certificate was installed
ru: Сертификат установлен

source: Not valid.
ru: Неверное значение.

source: Max len:%d
ru: Максимальная длина: %d

source: Not allowed value.
ru: Не разрешенное значение.

source: Mandatory field.
ru: Обязательное поле.

source: Value not valid.
ru: Неверное значение.

source: Max len:%d
ru: Максимальная длина:%d

source: Create registration request.
ru: Создание запроса на регистрацию.

source: Error: cant't get password
ru: Не удалось получить пароль

source: Token ID: %s Password: %s Do you want to use it now?
ru: ID маркера: %s Пароль: %s Использовать этот маркер прямо сейчас?

source: User registered.
ru: Пользователь зарегистрирован.

source: Request under submission. Contact CA administrator. Token ID: %s Password: %s Do you want to use it now?
ru: Запрос на рассмотрении. Свяжитесь с администратором УЦ. ID маркера: %s Пароль: %s Использовать этот маркер прямо сейчас?

source: Registration request pending.
ru: Запрос на регистрацию на рассмотрении.

source: Registration request send. Registration status unknown.
ru: Запрос на регистрацию отправлен. Состояние регистрации не известно.

source: Specify token ID and password.
ru: Укажите ID маркера и пароль.

source: Request ID: %d
ru: Идентификатор запроса: %d

source: Registration confirmed
ru: Регистрация одобрена

source: Registration under submission. Contact CA administrator or check later.
ru: Запрос в обработке. Свяжитесь с администратром УЦ

source: Can't get registration status
ru: Не удалось получить состояние регистрации

source: Registration status.
ru: Состояние регистрации

source: Do you really want to confirm certificate installation and close marker?
ru: Вы действительно хотите подтвердить установку сертификата и закрыть маркер временного доступа?

source: Marker closed
ru: Маркер закрыт

source: CA certificate was installed
ru: Сертификат УЦ установлен

source: Not implemented
ru: Не реализовано

source: Input token ID and password:
ru: Введите ID маркера и пароль:

source: Invalid password
ru: Недопустимый пароль

source: Invalid URL
ru: Недопустимое значение URL

source: Installing root certificate
ru: Установка корневого сертификата

source: Do you want to add certificate to root store? Thumbprint:
ru: Вы действительно хотите установить корневой сертификат? Отпечаток:

source: Yes
ru: Да

source: No
ru: Нет

source: CryptoPro CSP
ru: КриптоПро CSP

source: Valid
ru: Действителен

source: Cannot Acquire Context Error=%x
ru: Ошибка %x при выполнении функции CryptAcquireContext

source: GetProvParam failed Error=%x
ru: Ошибка %x при выполнении функции GetProvParam

source: Not enough memory
ru: Недостаточно памяти

source: Integrity check failed
ru: Целостность КриптоПро CSP нарушена

source: Integrity check successed
ru: Проверка целостности КриптоПро CSP успешна

source: Results:
ru: Результаты:

source: PKZI Build
ru: Номер сборки:

source: SKZI Build
ru: Версия ядра:

source: Architecture
ru: Архитектура

source: OS
ru: ОС

source: Checksums:
ru: Проверено модулей:

source: Block
ru: Имя модуля:

source: Initial Hash:
ru: Ожидаемый хэш:

source: Calculated Hash:
ru: Полученный хэш:

source: Select CA type
ru: Выберите тип УЦ

source: CryptoPro CA 1.5
ru: КриптоПро УЦ 1.5

source: CryptoPro CA 2.0
ru: КриптоПро УЦ 2.0

source: Microsoft CA standalone
ru: Изолированный Microsoft УЦ

source: Input request ID:
ru: Введите ID запроса:

source: Submit
ru: Отправить

source: Common name
ru: Общее имя

source: Organization
ru: Организация

source: Title
ru: Должность

source: User information:
ru: Данные пользователя:

source: Certificate usage:
ru: Назначение сертификата:

source: Web client
ru: Веб клиент

source: E-mail protection
ru: Защита электронной почты

source: Other usages
ru: Другие назначения

source: Certificate is pending, RequestID=%d
ru: Запрос в рассмотрении. Идентификатор запроса: %d

source: %@ failed. Error: %@
ru: Функция %@ завершилась неудачно. Ошибка: %@

source: Tap to generate random data
ru: Нажимайте для генерации случайных данных

source: Do you want to cancel key generation?
ru: Вы хотите отменить создание ключа?

source: Reader:
ru: Считыватель:

source: Use smart cart
ru: Использовать считыватель смарт карт

source: Allowed values are: %@.
ru: Разрешенные значения: %@.

source: Set default provider
ru: Выбор провайдера по умолчанию

source: Default provider
ru: Провайдер по умолчанию

source: Setting default provider succesful. Restart application to apply changes.
ru: Провайдер выбран. Перезапустите приложение чтобы изменения вступили в силу.

source: No providers available.
ru: Провайдеры не настроены

source: Only one provider is available:%s
ru: Наcтроен только один провайдер:%s

source: Setting default provider failed
ru: Не удалось установать провайдер по умолчанию.

source: No items to select.
ru: Нет элементов для выбора.

source: Up
ru: Вверх

source: Down
ru: Вниз

source: PIN is incorrect. %d tries left.
ru: Введен неправильный PIN. Осталось %d попыток.

source: Provider type:
ru: Тип провайдера:

source: Getting CA certificate
ru: Получение сертификата УЦ

source: Getting registration information
ru: Получение регистрационной формы

source: Checking registration status
ru: Проверка статуса регистрации

source: Getting request templates
ru: Получение шаблонов

source: Getting list of certificates
ru: Получение списка сертификатов

source: User registration
ru: Регистрация пользователя

source: Getting certificate
ru: Получение сертификата

source: Creating and sanding request
ru: Создание запроса на сертификат

source: Creating request
ru: Создание запроса

source: Sending request
ru: Отправление запроса

source: Installing certificate
ru: Установка сертификата

source: Getting request
ru: Получение запроса

source: Select provider type:
ru: Выберите тип провайдера

source: Install certificates from containers
ru: Установить сертификаты из контейнеров

source: Error installing certificates
ru: Ошибка при установке сертификатов

source: Successful installing certificates
ru: Установка сертификатов завершилась успешно

source: Containers were not found
ru: Контейнеры не найдены

source: Installing certificates
ru: Установка сертификатов

source: Do you really want to install certificates from containers?
ru: Вы действительно хотите установить сертификаты из контейнеров?

source: All certificates will be installed in Root store, CRLs - in CA store. Input URL for CRL or certificate:
ru: Все сертификаты будут установлены в хранилище Root, CRL - в хранилище CA. Введите адрес для скачивания сертификата или CRL

source: Istalling certifictes/CRLs
ru: Установка сертификатов/crl

source: Error retrieving URL
ru: Ошибка при обращении к странице

source: %d certificate(s) and %d CRL(s) were installed successfully
ru: %d сертификат(ов) и %d CRL были установлены успешно

source: Installing certificate/CRL finished with error code: %d.
ru: Ошибка при установке сертификатов/CRL, код: %d.

source: Download and install CRL or root certificate
ru: Скачать и установить корневой сертификат или CRL

source: Deleting passwords
ru: Удаление паролей

source: Do you really want to delete passwords?
ru: Вы действительно хотите удалить пароли?

source: Successful deleting passwords
ru: Удаление паролей завершилось успехом

source: Error deleting passwords
ru: Удаление паролей завершилось ошибкой

source: Delete saved passwords
ru: Удалить сохраненные пароли

source: Remember
ru: Запомнить

source: <password>
ru: <пароль>

source: <confirmation>
ru: <подтверждение>
