/*
 * Copyright(C) 2000 Проект ИОК
 *
 * Этот файл содержит информацию, являющуюся
 * собственностью компании Крипто Про.
 *
 * Любая часть этого файла не может быть скопирована,
 * исправлена, переведена на другие языки,
 * локализована или модифицирована любым способом,
 * откомпилирована, передана по сети с или на
 * любую компьютерную систему без предварительного
 * заключения соглашения с компанией Крипто Про.
 */

#if !defined _READER_RDR_DECL_H
#define _READER_RDR_DECL_H

#if defined _WIN32 && !defined WIN32
#define WIN32
#endif /* _WIN32 && !WIN32 */

#endif /* !_READER_RDR_DECL_H */
